/*
Под боем?

Условие
Даны несовпадающие координаты ферзя и коня на шахматном поле размером 8×8. Требуется определить, бьет ли одна из фигур другую.

Формат входных данных
Входной файл содержит четыре разделённых пробелом целых числа x1, y1, x2 и y2 (1≤x1,y1,x2,y2≤8) — координаты ферзя и коня соответственно.


Формат выходных данных
Требуется вывести «queen», если ферзь бьёт коня, «knight», если конь бьёт ферзя, и «none», если ни одна из фигур не находится под боем.

входные данные	    выходные данные
8 3 6 2             knight

*/


//доделай 11 номер 3 часть 