/*
Условие
У каждой пары обуви, что продается в магазине, есть артикул (номер, по которому её можно найти среди других).

В последней цифре артикула зашифровано, как давно была выпущена модель. Чем больше цифра, тем более модная обувь.

Дан список артикулов (восьмизначные целые положительные числа), вводится одной строкой.

Расположите элементы в порядке убывания последней цифры числа. Если последние цифры в артикулах одинаковы, артикулы должны сохранять исходный порядок.


входные данные	                                              выходные данные

5
51372302 90666802 56827377 25549731 62566624
                                                              56827377
                                                              62566624
                                                              51372302
                                                              90666802
                                                              25549731
===========================================================================
5
57952455 11104065 87365035 62007785 89503155
                                                              57952455
                                                              11104065
                                                              87365035
                                                              62007785
                                                              89503155
*/

#include<stdio.h>

int main(){


  return 0;
}