/*
Условие
Дана последовательность целых чисел, оканчивающаяся нулём. Необходимо найти число, наиболее близкое к максимальному по величине числу в этой последовательности (второй максимум). Ноль числом последовательности не считается.

Если в последовательности два числа равных максимуму, то вторым максимумом считается число равное первому максимуму.

Формат входных данных
Вводится не более чем 215 целых чисел, каждое из которых не превосходит по модулю 2^15−1. После последнего числа вводится 0. Гарантируется, что последовательность содержит хотя бы два элемента.


входные данные	выходные данные
13
42
6
0                13
=======================================================
33
32
33
0                 33
*/