/*
Условие
Имеется список актёров, пришедших на пробы в новый кинофильм, с указанием роста каждого из них в сантиметрах. Выясните, перечислены ли актеры в списке в порядке убывания их роста.

Формат входных данных
Вводится несколько целых чисел, обозначающих рост каждого из актёров. После последнего числа вводится −1. Гарантируется, что количество актеров на пробах не превосходит 50, и хотя бы один актер есть.

Формат выходных данных
Выведите «YES», если условие задачи выполняется, и «NO» в противном случае.



входные данные	выходные данные
156
178
180
144
167
-1                  NO
===========================
181
176
169
166
156
-1                  YES




*/