/*
Условие
Помимо тех, кто рад успеху Леонардо Ди Каприо, есть и те, кто сомневается в его победе. Завистливые соперники утверждают, что результаты голосования были сфабрикованы, и требуют проверить цифры. Так, если подряд стоят 4 максимальных оценки, говорят они, Лео получил статуэтку незаслуженно.

Помогите докопаться до правды: с клавиатуры вводятся числа-оценки, последовательность заканчивается отрицательным числом. Если максимальная оценка встретилась подряд 4 и более раз, на экран необходимо вывести "Falsification!" (с англ. фальсификация), иначе вывести "Congratulations!" (с англ. поздравления).

Формат входных данных
Последовательность целых положительных чисел, оканчивающаяся отрицательным значением. Гарантируется, что есть хотя бы одна оценка.

Формат выходных данных
Требуется вывести соответствующую фразу.



входные данные	выходные данные
5
7
9
9
9
4
3
9
1
-1                  Congratulations!
==========================================
11
11
11
11
8
6
5
11
6
5
10
-1                  Falsification!




*/