/*
Условие
Мистер Вайл путешествует по планете, чтобы лично присутствовать на кинопремьерах своего нового драматически-комедийного фильма о шпионах на туманном острове в Индийском океане. Это суперхит!

Дана последовательность сокращенных обозначений названий стран, где был актёр за время своего путешествия.

Конец последовательности – это слово "end". 

Сколько раз Мистер Вайл был в Германии (в сокращенных обозначениях "ger")?

Формат входных данных
Последовательность трёхсимвольных обозначений стран, каждое с новой строки, оканчивающаяся словом "end". Гарантируется, что количество стран ≤ 100000 и больше 0.

Формат выходных данных
Одно число – ответ.

входные данные	выходные данные
ger
usa
frn
ger
rus
rus
ger
end                3
============================
tai
tuk
ger
tur
ger
end                 2

*/