/*
Условие
Дана последовательность целых чисел, оканчивающаяся числом −1. Необходимо определить, присутствует ли в последовательности хотя бы одна пара одинаковых «соседних» чисел. Число −1
 членом последовательности не является.

Формат входных данных
Вводится не более 2^15 целых чисел ai (−2^15≤a_i≤2^15−1; a_i≠−1). После последнего числа вводится −1. Гарантируется, что в последовательности есть хотя бы два числа.

Формат выходных данных
Выведите «YES», если условие задачи выполняется, и «NO» в противном случае.

Примеры
входные данные	выходные данные
1 
2 
3 
4 
5 
-1              NO
=================================
6 
13 
13 
42 
-1              YES



*/