/*
Условие
Дана непустая последовательность целых чисел, оканчивающаяся отрицательным числом. Необходимо определить, равны ли между собой все элементы последовательности. Отрицательное число членом последовательности не является.

Формат входных данных
Вводится не более, чем 2^15 целых неотрицательных чисел, каждое из которых не превосходит (2^31−1). После последнего числа вводится отрицательное число s (s≥−2^31).

Формат выходных данных
Выведите «YES», если условие задачи выполняется, и «NO» в противном случае.

входные данные	выходные данные
1
2 
3 
4 
5 
-1                NO
================================
42
42 
42 
-42              YES

*/