/*
Условие
Напишите функцию void sum_arrays(int *a, int *b, int n, int* ans), которая складывает соответствующие элементы двух массивов a и b одинаковой длины n и возвращает новый массив ans.

Функция не должна менять массивы a и b.

С клавиатуры вводится число n и оба массива, ваша цель — вывести новый массив-сумму.

Формат входных данных
В первой строке вводится натуральное число n (1 ≤ n ≤ 105) — длина массивов.

Во второй и третьей строке находятся по n целых чисел, не превосходящих 109 по модулю, — элементы массивов.

Формат выходных данных
Требуется вывести массив, состоящий из сумм, который получен из функции sum_arrays.

Примеры
входные данные	выходные данные
4
1 5 7 2
4 9 1 2          5 14 8 4

*/