/*

Условие
В обязанности стажера Буди Бинга входит ещё и отправка/принятие сообщений с Земли.

На той неделе прислали данные, но в последнем элементе списка какой-то космический мусор. Помогите почистить данные, нужно удалить последний элемент из полученного списка.

Формат входных данных
Вводится список целых чисел одной строкой.

Формат выходных данных
Выведите итоговый список: элементы в одну строку через пробел.


входные данные	                     выходные данные
8
4 5 6 2 6 3 6 2343434                4 5 6 2 6 3 6
=============================================================
15
1 0 1 0 0 1 1 1 0 1 0 1 1 0 99       1 0 1 0 0 1 1 1 0 1 0 1 1 0


*/

/*
int a1[100]

for(int i=0;i<n;i++)
  scanf("%d",a1[i])

int a2[100]
for(int i=0;i<n-1;i++)
  a2[i] = a1[i]

for( i < n-1 )


*/