/*
Условие
  Добавим в нашего "Секретаря" возможность считывать сразу много оценок и добавлять к уже имеющемуся набору оценок новый набор.


Считайте первый массив оценок, полученных на прошлой неделе.
Они вводятся в одну строку.

Считайте второй массив оценок – новые оценки этой недели.
Второй набор оценок тоже вводится в строку.

Добавьте список новых оценок к первому массиву.
Результат выведите на экран в одну строку (элементы напечатаны через пробел).


максимальная общая длина не превосходит 100

входные данные	              выходные данные
5
3 4 5 5 3 
3
2 2 2                         3 4 5 5 3 2 2 2
======================================
10 = n
3 3 3 3 3 3 3 3 3 3 3
10 = m
4 5 4 5 4 5 4 4 5 4 5        3 3 3 3 3 3 3 3 3 3 3 4 5 4 5 4 5 4 4 5 4 5
*/

