/*
Условие
Вася договорился с учительницей, что в честь его дня рождения она сотрёт все двойки из журнала. Тогда у него в журнале останутся оценки только 3, 4 и 5.
Найдите Васино новое среднее арифметическое, которое получится без учёта всех его двоек.
Ответ выведите с точностью до сотых. Если никаких оценок кроме двоек изначально не было, то выведите фразу "К сожалению, у вас были только двойки".


входные данные	                  выходные данные
11
3 2 4 5 2 4 5 2 2 2 2            4.2
=================================================================
13
2 2 2 2 2 2 2 2 2 2 2 2 2        К сожалению, у вас были только двойки

*/