/*
Условие
Даны числа a и b. Для каждого из чисел промежутка от a до b требуется вывести само число, число, превосходящее данное на 5 и остаток от деления данного числа на 6.

Формат входных данных
В единственной строке находятся два целых числа a и b, (0≤a≤b≤105).

Формат выходных данных
Необходимо вывести b−a+1 строку троек чисел через пробел.


входные данные	выходные данные
1 5
                  1 6 1
                  2 7 2
                  3 8 3
                  4 9 4
                  5 10 5


*/