/*
Условие
Выведите на экран все числа между A и B включительно в порядке возрастания.

Формат входных данных
Вводятся два целых числа А и В (|А|, |В| ≤ 100).

Формат выходных данных
Требуется вывести в столбик числа из диапазона от А до В.

входные данные	выходные данные
3 6
                  3
                  4
                  5
                  6
=======================
98 90
                  90
                  91
                  92
                  93
                  94
                  95
                  96
                  97
                  98

*/
#include<stdio.h>

int main(){
int a,b;

for(int i=a; i<=b;i++){
  printf("%d",i);

}



 return 0;                 
}