/*
Условие
1-го марта гражданин открыл счет в банке, вложив 1000 рублей. Через каждый месяц размер вклада увеличивался на 2%  от имеющейся на этот момент суммы. Необходимо определить, прирост суммы вклада за n-й месяц.

Формат входных данных
Вводится целое число n(1≤n≤320).

Формат выходных данных
Требуется вывести искомое значение прироста суммы с точностью не менее шести знаков после запятой.



входные данные	выходные данные
1
                  20.000000
===============================
2
                  20.400000

*/