/*

Условие
У Аркадия есть мечта – зарабатывать на покупке и продаже ценных бумаг.

Дан список – предсказания, сколько будет стоить ценная бумага в каждый из день некоторого периода времени. Аркадий хочет совершить одну покупку и одну продажу этой ценной бумаги.

Напишите функцию calculate_profit(массив, размер), получающую на вход список цен, а на выход возвращает наибольшую прибыль (сумму денег),  которую может заработать Аркадий на 1 покупке и 1 продаже ценной бумаги. Если заработать при такой раскладке цен невозможно, то выведите 0. т.к., очевидно, выгоднее ничего не покупать.

Пример: 

Дано: 10 20 30 40 35 25

Аркадий покупает бумагу за 10 (в первый день) и продает за 40 (на 4 день). Итого, прибыль 40 – 10 = 30 рублей. 30 рублей заработал Аркадий, купив и продав ценную бумагу.


входные данные	              выходные данные
7
10 20 30 40 50 2 100          98


5
10 20 30 40 50                40

*/